# Напишите программу, которая на вход принимает число N 
# и выдает последовательность из N членов

# num = int(input('Введите число: '))
# i = 1
# n = 1

# while i <= num:
#     print(n, end = (' '))
#     n = n * (-3)
#     i += 1

# Для натурального N создать последовательность 3n+1

# num = int(input('Введите число: '))
# i = 1

# while i <= num:
#     n = 3 * i + 1
#     print(str(i) + ':' + str(n) + ',')
#     i += 1

# Напишите программу, в которой пользователь будет задавать две строки, 
# а программа определять колличество вхождений одной строки в другой. 

# text1 = str(input('Введите текст: '))
# text2 = str(input('Введите искомый элемент: '))

# print(text1.count(text2))
     